[
  {
    "id": "ecosystem-support",
    "title": "Entrepreneurship Ecosystem Support for Purpose-Driven Practices",
    "icon": "◆",
    "order": 1,
    "subsections": [
      {
        "heading": "Vidacity as a Startup Habitat",
        "paragraphs": [
          "Vidacity, a repurposed primary school (formerly Loyang Primary School) in Henderson, has been turned into a sustainability-focused innovation hub. It's more than just a co-working space — Vidacity practises what it preaches by reusing what's already there instead of starting from scratch. The campus still looks and feels like a school, with classrooms converted into startup offices and corridors lined with sustainability exhibits. It's the kind of place where a startup like BugBoom fits right in.",
          "Vidacity rents out space for under $500 a month, which is a big deal for a student startup that's losing money. But it's more than just cheap rent. Having other sustainability startups nearby means founders can swap advice, share resources, and just talk things out over coffee — a few of us noticed this during the visit."
        ]
      },
      {
        "heading": "Support Mechanisms That Enable Survival",
        "bullets": [
          "Affordable infrastructure: Below-market rent allows founders to allocate limited funds toward R&D and operations rather than overhead.",
          "Community of practice: Having other sustainability startups around means there's peer mentorship, shared problem-solving, and moral support during the tough times.",
          "Proximity to NTU: As an NTU spinoff, BugBoom gets access to research resources, faculty guidance, and student talent.",
          "Structured funding accountability: The KSIP (Kumar Sustainability & Innovation Prize) gives out prize money in two parts — the second half only comes after six months of showing financial responsibility and progress, which forces early discipline.",
          "Shared sustainability infrastructure: Vidacity's campus features vertical hydroponic farms, solar panels, microforests, and educational exhibits that create a living laboratory for all resident startups."
        ]
      },
      {
        "heading": "Why This Matters for Purpose-Driven Startups",
        "paragraphs": [
          "Startups like BugBoom take longer to become profitable than typical businesses. BugBoom's founders juggle their startup alongside academics and other work, which just wouldn't be possible without the support system around them. Vidacity gives them breathing room to keep working on their BSF technology and business model without having to chase short-term money at the expense of their mission. As Finding 06 notes, for startups like BugBoom, having a supportive home base is just as important as the idea itself."
        ]
      }
    ]
  },
  {
    "id": "why-what-how-who-impact",
    "title": "WHY, WHAT, HOW, WHO, and IMPACT",
    "icon": "◇",
    "order": 2,
    "subsections": [
      {
        "heading": "WHY: The Problem and Purpose",
        "paragraphs": [
          "Singapore generated 784,000 tonnes of food waste in 2024, with only 18% recycled. Food waste makes up about 12% of total waste generated nationally. The founders saw this as more than just a statistic — all those nutrients are being burned instead of put back to use. They genuinely believe that waste is just a resource in the wrong place. As they put it: 'We're not just managing waste; we're keeping nutrients in the loop, where they belong.'"
        ]
      },
      {
        "heading": "WHAT: The Solution",
        "paragraphs": [
          "BugBoom uses Black Soldier Fly (BSF) technology to convert food waste into high-quality organic fertiliser (frass) and protein-rich larvae biomass. On top of their physical products, they also run workshops and community events — basically teaching people about sustainability as part of their business. Their product line includes BSF larvae frass in 100g and 1kg kraft bags, food waste management services, and structured sustainability workshops for schools and the public."
        ]
      },
      {
        "heading": "HOW: The Operational Process",
        "bullets": [
          "Source food waste from partner sites (e.g., NTU Quad Cafe, Chewy Junior's non-conforming bread).",
          "Screen and prepare waste to reduce contamination and ensure consistent feedstock quality.",
          "Introduce food waste to BSF larvae under controlled environmental conditions (optimal temperature ~39.5°C).",
          "Larvae break down food waste through bioconversion, producing larval biomass and frass.",
          "Harvest and separate outputs, sieving frass from larvae for distinct product streams.",
          "Process outputs into packaged farm products for sale.",
          "Offer on-site BSF composting for decentralised, localised waste treatment.",
          "Run educational workshops to build public understanding and overcome the 'yuck factor' barrier."
        ]
      },
      {
        "heading": "WHO: The Founding Team",
        "paragraphs": [
          "BugBoom is led by four NTU student co-founders, each handling a different part of the business: Sreeram Vasanth, Ivan Ong (COO, overseeing daily operations and development stages), Lim En Cheng, and Taha Basrai (Sustainability Director, leading international expansion). What we noticed during the visit was how well their roles fit together. Yet when asked 'At what valuation would you sell BugBoom?', their answers ranged from $350k (Taha) to 'never, at any price' (En Cheng), which says a lot about how personally invested each of them is."
        ]
      },
      {
        "heading": "IMPACT: Measurable and Aspirational",
        "bullets": [
          "Environmental: Diverts food waste from incineration, producing chemical-free organic fertiliser and reducing Singapore's waste-to-landfill burden.",
          "Educational: Workshops and community engagement build sustainability literacy, inspiring the next generation of environmental leaders.",
          "Economic: Shows that circular economy business models can actually work for student-run startups in Singapore.",
          "Scalable: The team is already preparing their model for international expansion, with Taha leading efforts to replicate the BugBoom approach in other countries.",
          "Cultural: Helps change how people think about insect-based solutions and shows that real sustainability work isn't always glamorous."
        ]
      }
    ]
  },
  {
    "id": "mindset-knowledge",
    "title": "Mindset Change and Knowledge Acquired During the Entrepreneurial Journey",
    "icon": "○",
    "order": 3,
    "subsections": [
      {
        "heading": "Key Mindset Shifts",
        "bullets": [
          "Perfectionism to iteration: The founders entered expecting to build a bulletproof plan before launching. Reality taught them that startups grow by trying things, messing up, and improving over time.",
          "Hackathon mindset to operational mindset: Winning the KSIP prize ($25k, later $50k) was just the starting line. The real work — daily operations, feedstock management, financial accountability — started after the prize ceremony.",
          "Product-first to customer-first thinking: Early focus on perfecting the BSF process gave way to realising that education, community trust, and public perception matter just as much as the tech.",
          "Individual effort to team-based problem solving: The founders learned that survival depends not just on their own effort, but on tapping into the Vidacity ecosystem — affordable space, mentorship, and support from fellow sustainability startups."
        ]
      },
      {
        "heading": "Knowledge Gaps They Had to Fill",
        "bullets": [
          "BSF biology and rearing science: Optimal temperature control (~39.5°C), feeding ratios, larvae lifecycle management, and environmental conditions for consistent bioconversion.",
          "Regulatory landscape: Understanding Singapore's strict policies on insect-based agriculture, import/export regulations, and compliance requirements for international expansion.",
          "Unit economics and pricing: Learning that their frass sells at approximately $7/pack, currently at a loss, and understanding how to balance mission with financial sustainability.",
          "Waste logistics: Managing inconsistent food waste composition from different sources, contamination control, and building reliable collection partnerships.",
          "Community engagement: Overcoming the 'yuck factor' of insect farming through structured workshops, hands-on demonstrations, and transparent communication about their process."
        ]
      },
      {
        "heading": "What This Reveals About Entrepreneurship",
        "paragraphs": [
          "The founders' journey shows that entrepreneurship is as much about personal growth as it is about building a product. The knowledge they needed (biology, regulations, economics, community management) was never taught in a single course. They picked it up through trial and error, conversations with mentors, and being willing to learn outside their comfort zones. That kind of learn-as-you-go attitude is what keeps a startup alive past the hackathon stage."
        ]
      }
    ]
  },
  {
    "id": "recommendations",
    "title": "Suggestions and Recommendations for Potential Founders",
    "icon": "✦",
    "order": 4,
    "subsections": [
      {
        "heading": "Five Recommendations from Our Observations",
        "bullets": [
          "Find your ecosystem early: A supportive place like Vidacity, with affordable space, mentorship, and community, makes a huge difference in survival odds. Startups like these can't afford to waste money on overhead when profits are still a long way off.",
          "Start selling before you're ready: BugBoom's early market testing, even at a loss (~$7/pack for frass), gave them real customer feedback and showed them there's demand. Waiting for a 'perfect' product means missing out on real-world lessons.",
          "Build a team with complementary skills, not just shared passion: Each BugBoom founder handles a different area (operations, international expansion, R&D, outreach). Shared purpose keeps the team together, but having different strengths is what actually moves things forward.",
          "Treat hackathon wins as seed funding, not validation: The KSIP prize was the beginning, not the end. Most teams break up after winning. The two-tranche payout model forced BugBoom to stay accountable. Other aspiring founders should look for similar structures.",
          "Embrace the unglamorous work: Sorting food waste, managing larvae, sieving frass, this is the daily reality behind every sustainability pitch deck. If you're not willing to do the 'unsexy' work, the venture won't survive past the idea stage."
        ]
      },
      {
        "heading": "Lessons from BugBoom's Challenges",
        "bullets": [
          "Regulatory barriers are real: Just because something works technically doesn't mean the market is ready for it. BugBoom's international expansion plans face strict import/export rules for insect-based products, and founders need to look into these regulations early.",
          "Co-founder alignment matters: When asked about their selling price, BugBoom's founders gave answers ranging from $350k to 'never sell.' Different perspectives can be healthy, but founders should talk about exit expectations and long-term goals early on.",
          "Education is a product, not just a cost: BugBoom's workshops bring in revenue while also building the public trust they need for their core business. Founders should think about how teaching what you do can become part of the business itself.",
          "Financial resilience takes creativity: With the startup losing money and founders balancing school and other work, staying financially sustainable means getting creative — tranche-based funding, multiple revenue streams (products + services + education), and keeping costs low."
        ]
      }
    ]
  }
]
