[
  {
    "id": "calvin-reflection",
    "title": "Passion for the Environment",
    "date": "2026-02-07",
    "tags": ["calvin-chan", "reflection"],
    "summary": "Before visiting BugBoom, my initial expectations of a student-formed startup was a very techy, software driven company. After arriving at Vidacity and seeing that it was previously a primary school, and being first greeted by the sustainability garden, I realised that this place was more than what I had imagined.",
    "heroImage": "assets/photos/BBsitevisit (5).jpg",
    "content": [
      { "type": "text", "value": "Before visiting BugBoom, my initial expectations of a student-formed startup was a very techy, software driven company." },
      { "type": "text", "value": "After arriving at Vidacity and seeing that it was previously a primary school, and being first greeted by the sustainability garden, I realised that this place was more than what I had imagined." },
      { "type": "image", "src": "assets/photos/BBsitevisit (35).jpg", "alt": "Vidacity Microforest", "caption": "The former Loyang Primary School turned sustainability hub." },
      { "type": "text", "value": "Touring the area we see how the companies there work in harmony with the environment by creating artwork upcycled from plastics, and using coffee grounds to create art pieces." },
      { "type": "text", "value": "I learnt that passion for the environment can be a strong driver to motivate these founders to work hard to create solutions that not many are interested in solving." },
      { "type": "text", "value": "I am inspired by each of the founders' stories, how they come together from different backgrounds and all serve different functions, but with a shared goal - to better manage food waste for a more sustainable environment." }
    ],
    "keyTakeaways": []
  },
  {
    "id": "gerald-reflection",
    "title": "Grit Over Glamour",
    "date": "2026-02-07",
    "tags": ["gerald-koh", "reflection"],
    "summary": "Going into BugBoom, I was kind of expecting a fairly clean and polished startup, thinking slick demos and showcases. Instead, what I encountered was something refreshingly grounded, human and practical.",
    "heroImage": "assets/photos/BBsitevisit (66).jpg",
    "content": [
      { "type": "text", "value": "Going into BugBoom, I was kind of expecting a fairly clean and polished startup, thinking slick demos and showcases. Instead, what I encountered was something refreshingly grounded, human and practical." },
      { "type": "text", "value": "Even from our first impressions seeing Vidacity being repurposed from a primary school, to seeing BugBoom’s founders being knee-deep in it's daily operations, unafraid to get their hands dirty with trays of black soldier fly larvae processing NTU Quad Cafe waste." },
      { "type": "text", "value": "And this learning journey ultimately shifted how I viewed entrepreneurship and the startup scene here in Singapore." },
      { "type": "image", "src": "assets/photos/BBsitevisit (73).jpg", "alt": "Sieving frass from the BSF larvae", "caption": "Sieving frass from the BSF larvae" },
      { "type": "text", "value": "What they shared, and the passion that they exuded was raw and unfiltered, fueled by relatable motivation, their answers were unscripted and clearly backed by what they’ve learnt along the way through trial and error." },
      { "type": "text", "value": "This demystified the entrepreneurship journey for me, revealing how it's 90% persistence through seemingly-endless hurdles like scaling pains, working around space constraints, and forging and maintaining long-term professional relationships." },
      { "type": "text", "value": "This really cracked my perfectionist mindset, showing me that ideas can be developed over time and does not need to, and is practically impossible, to be bulletproof from the beginning." },
      { "type": "text", "value": "Real ventures evolve through scrappy iteration, starting imperfect and refined over time. Entrepreneurship here isn't about perfection; it's about embracing the mess to create meaningful impact." }
    ],
    "keyTakeaways": [
      "Passion and persistence are more important than perfection in early-stage ventures",
      "Entrepreneurship is a messy, iterative process — ideas evolve through trial and error"
    ]
  },
  {
    "id": "xinyang-reflection",
    "title": "Small Creatures, Big Circular Dreams",
    "date": "2026-02-07",
    "tags": ["xin-yang", "reflection"],
    "summary": "In a former school turned sustainability hub, I met BugBoom’s four founders and watched their Black Soldier Fly system quietly do something we struggle with at scale: turn “waste” into inputs again.",
    "heroImage": "assets/photos/BBsitevisit (68).jpg",
    "content": [
      { "type": "text", "value": "In a former school turned sustainability hub, I met BugBoom’s four founders and watched their Black Soldier Fly system quietly do something we struggle with at scale: turn “waste” into inputs again." },
      { "type": "text", "value": "Vidacity still feels like it remembers its previous life as a school. Classrooms have been repurposed into startup spaces, and the whole campus carries this quiet message: you can reuse what already exists, instead of building from scratch." },
      { "type": "title", "value": "Meeting the people behind BugBoom" },
      { "type": "text", "value": "During the visit, I got to speak with all four founders — Sreeram Vasanth, Ivan Ong, Lim En Cheng, and Taha Basrai." },
      { "type": "text", "value": "What struck me immediately was how unpolished (in a good way) the work is. BugBoom isn’t the kind of sustainability project that lives comfortably in slides. It’s hands-on, operational, and a little uncomfortable — the kind of work where you can’t “idea” your way out of reality." },
      { "type": "text", "value": "From what they share publicly, BugBoom’s mission is to tackle food waste by cultivating Black Soldier Flies and using their by-products to recirculate nutrients back into the economy — through a mix of food-waste management services, products, and educational workshops." },
      { "type": "title", "value": "The moment it clicked for me" },
      { "type": "text", "value": "I’ve heard “circular economy” so many times that it’s started to sound like a slogan. But standing there, watching the system up close, the idea became… embarrassingly simple." },
      { "type": "text", "value": "Food waste isn’t “gone” just because we throw it away. It becomes someone else’s problem — and usually, it becomes it fast. BugBoom’s approach flips that story: treat food waste as a feedstock, and build a process where outputs are useful again." },
      { "type": "text", "value": "And it’s not just the biology that’s hard. The founders kept circling back to the unglamorous parts:" },
      { "type": "bullet-list", "value": [
        "how inconsistent real food waste can be,",
        "how operations need routines and discipline,",
        "how trust and partnerships matter when you’re dealing with other people’s waste streams,",
        "and how education is part of scaling, because public perception can be a bigger barrier than technology."
      ] },
      { "type": "text", "value": "I left with a new respect for “messy” sustainability — the kind that doesn’t photograph nicely, but actually moves numbers." },
      { "type": "title", "value": "What I’m taking away (personally)" },
      { "type": "text", "value": "Today reminded me that sustainability isn’t just about having the right values — it’s about building systems that still work when conditions aren’t perfect." },
      { "type": "image", "src": "assets/photos/BBsitevisit (43).jpg", "alt": "Vidacity's Grand Opening Signage", "caption": "Vidacity's Grand Opening Signage" },
      { "type": "text", "value": "BugBoom made me reflect on two things:" },
      { "type": "number-list", "value": [
        "Impact can be physical. You can literally see transformation when the process is real, measurable, and repeatable.",
        "Founders are translators. They’re translating a climate problem into a set of daily decisions: what to measure, what to test, what to fix, and what to explain—again and again."
      ]
      },
      { "type": "text", "value": "On the ride home, I caught myself thinking: if four students can take on a problem as unsexy as food waste and still keep showing up to iterate, then the least I can do is be more intentional about what I waste — and how I think about “invisible” environmental problems." },
      { "type": "text", "value": "Some solutions don’t look heroic. Sometimes they look like a small team, a lot of trial-and-error, and a box where nature is quietly doing the work." }
    ],
    "keyTakeaways": []
  }
]
