[
  {
    "id": "calvin-reflection",
    "title": "Passion for the Environment",
    "date": "2026-02-07",
    "tags": ["calvin-chan", "reflection"],
    "summary": "Before visiting BugBoom, my initial expectations of a student-formed startup was a very techy, software driven company. After arriving at Vidacity and seeing that it was previously a primary school, and being first greeted by the sustainability garden, I realised that this place was more than what I had imagined.",
    "heroImage": "assets/photos/BBsitevisit (5).jpg",
    "content": [
      { "type": "text", "value": "Before visiting BugBoom, my initial expectations of a student-formed startup was a very techy, software driven company." },
      { "type": "text", "value": "After arriving at Vidacity and seeing that it was previously a primary school, and being first greeted by the sustainability garden, I realised that this place was more than what I had imagined." },
      { "type": "image", "src": "assets/photos/BBsitevisit (35).jpg", "alt": "Vidacity Microforest", "caption": "The former Loyang Primary School turned sustainability hub." },
      { "type": "text", "value": "Touring the area we see how the companies there work in harmony with the environment by creating artwork upcycled from plastics, and using coffee grounds to create art pieces." },
      { "type": "text", "value": "I learnt that passion for the environment can be a strong driver to motivate these founders to work hard to create solutions that not many are interested in solving." },
      { "type": "text", "value": "I am inspired by each of the founders' stories, how they come together from different backgrounds and all serve different functions, but with a shared goal - to better manage food waste for a more sustainable environment." }
    ],
    "keyTakeaways": []
  },
  {
    "id": "gerald-reflection",
    "title": "Grit Over Glamour",
    "date": "2026-02-07",
    "tags": ["gerald-koh", "reflection"],
    "summary": "Going into BugBoom, I was kind of expecting a fairly clean and polished startup, thinking slick demos and showcases. Instead, what I encountered was something refreshingly grounded, human and practical.",
    "heroImage": "assets/photos/BBsitevisit (66).jpg",
    "content": [
      { "type": "text", "value": "Going into BugBoom, I was kind of expecting a fairly clean and polished startup, thinking slick demos and showcases. Instead, what I encountered was something refreshingly grounded, human and practical." },
      { "type": "text", "value": "Even from our first impressions seeing Vidacity being repurposed from a primary school, to seeing BugBoom’s founders being knee-deep in it's daily operations, unafraid to get their hands dirty with trays of black soldier fly larvae processing NTU Quad Cafe waste." },
      { "type": "text", "value": "And this learning journey ultimately shifted how I viewed entrepreneurship and the startup scene here in Singapore." },
      { "type": "image", "src": "assets/photos/BBsitevisit (73).jpg", "alt": "Sieving frass from the BSF larvae", "caption": "Sieving frass from the BSF larvae" },
      { "type": "text", "value": "What they shared, and the passion that they exuded was raw and unfiltered, fueled by relatable motivation, their answers were unscripted and clearly backed by what they’ve learnt along the way through trial and error." },
      { "type": "text", "value": "This demystified the entrepreneurship journey for me, revealing how it's 90% persistence through seemingly-endless hurdles like scaling pains, working around space constraints, and forging and maintaining long-term professional relationships." },
      { "type": "text", "value": "This really cracked my perfectionist mindset, showing me that ideas can be developed over time and does not need to, and is practically impossible, to be bulletproof from the beginning." },
      { "type": "text", "value": "Real ventures evolve through scrappy iteration, starting imperfect and refined over time. Entrepreneurship here isn't about perfection; it's about embracing the mess to create meaningful impact." }
    ],
    "keyTakeaways": [
      "Passion and persistence are more important than perfection in early-stage ventures",
      "Entrepreneurship is a messy, iterative process — ideas evolve through trial and error"
    ]
  },
  {
    "id": "xinyang-reflection",
    "title": "Small Creatures, Big Circular Dreams",
    "date": "2026-02-07",
    "tags": ["xin-yang", "reflection"],
    "summary": "In a former school turned sustainability hub, I met BugBoom’s four founders and watched their Black Soldier Fly system quietly do something we struggle with at scale: turn “waste” into inputs again.",
    "heroImage": "assets/photos/BBsitevisit (68).jpg",
    "content": [
      { "type": "text", "value": "In a former school turned sustainability hub, I met BugBoom’s four founders and watched their Black Soldier Fly system quietly do something we struggle with at scale: turn “waste” into inputs again." },
      { "type": "text", "value": "Vidacity still feels like it remembers its previous life as a school. Classrooms have been repurposed into startup spaces, and the whole campus carries this quiet message: you can reuse what already exists, instead of building from scratch." },
      { "type": "title", "value": "Meeting the people behind BugBoom" },
      { "type": "text", "value": "During the visit, I got to speak with all four founders — Sreeram Vasanth, Ivan Ong, Lim En Cheng, and Taha Basrai." },
      { "type": "text", "value": "What struck me immediately was how unpolished (in a good way) the work is. BugBoom isn’t the kind of sustainability project that lives comfortably in slides. It’s hands-on, operational, and a little uncomfortable — the kind of work where you can’t “idea” your way out of reality." },
      { "type": "text", "value": "From what they share publicly, BugBoom’s mission is to tackle food waste by cultivating Black Soldier Flies and using their by-products to recirculate nutrients back into the economy — through a mix of food-waste management services, products, and educational workshops." },
      { "type": "title", "value": "The moment it clicked for me" },
      { "type": "text", "value": "I’ve heard “circular economy” so many times that it’s started to sound like a slogan. But standing there, watching the system up close, the idea became… embarrassingly simple." },
      { "type": "text", "value": "Food waste isn’t “gone” just because we throw it away. It becomes someone else’s problem — and usually, it becomes it fast. BugBoom’s approach flips that story: treat food waste as a feedstock, and build a process where outputs are useful again." },
      { "type": "text", "value": "And it’s not just the biology that’s hard. The founders kept circling back to the unglamorous parts:" },
      { "type": "bullet-list", "value": [
        "how inconsistent real food waste can be,",
        "how operations need routines and discipline,",
        "how trust and partnerships matter when you’re dealing with other people’s waste streams,",
        "and how education is part of scaling, because public perception can be a bigger barrier than technology."
      ] },
      { "type": "text", "value": "I left with a new respect for “messy” sustainability — the kind that doesn’t photograph nicely, but actually moves numbers." },
      { "type": "title", "value": "What I’m taking away (personally)" },
      { "type": "text", "value": "Today reminded me that sustainability isn’t just about having the right values — it’s about building systems that still work when conditions aren’t perfect." },
      { "type": "image", "src": "assets/photos/BBsitevisit (43).jpg", "alt": "Vidacity's Grand Opening Signage", "caption": "Vidacity's Grand Opening Signage" },
      { "type": "text", "value": "BugBoom made me reflect on two things:" },
      { "type": "number-list", "value": [
        "Impact can be physical. You can literally see transformation when the process is real, measurable, and repeatable.",
        "Founders are translators. They’re translating a climate problem into a set of daily decisions: what to measure, what to test, what to fix, and what to explain—again and again."
      ]
      },
      { "type": "text", "value": "On the ride home, I caught myself thinking: if four students can take on a problem as unsexy as food waste and still keep showing up to iterate, then the least I can do is be more intentional about what I waste — and how I think about “invisible” environmental problems." },
      { "type": "text", "value": "Some solutions don’t look heroic. Sometimes they look like a small team, a lot of trial-and-error, and a box where nature is quietly doing the work." }
    ],
    "keyTakeaways": []
  },
  {
    "id": "hazel-reflection",
    "title": "From Theory to Reality",
    "date": "2026-02-07",
    "tags": ["hazel", "reflection"],
    "summary": "Sustainability is a trendy topic nowadays. In Interdisciplinary Collaborative Core modules, we often discuss it theoretically, proposing solutions filled with scientific and technical terms. Sometimes, those ideas can be distant and hard to relate to. Visiting BugBoom gave me a much more realistic understanding of what sustainability looks like in practice in a startup setting.",
    "heroImage": "assets/photos/BBsitevisit (5).jpg",
    "content": [
      { "type": "text", "value": "Sustainability is a trendy topic nowadays. In Interdisciplinary Collaborative Core modules, we often discuss it theoretically, proposing solutions filled with scientific and technical terms. Sometimes, those ideas can be distant and hard to relate to. Visiting BugBoom gave me a much more realistic understanding of what sustainability looks like in practice in a startup setting." },
      { "type": "text", "value": "Vidacity welcomed us with a strong sense of everyday life. The nostalgic primary school setting, lively fish, and well-maintained greenery created a cozy atmosphere. This practical and grounded environment reflected BugBoom's approach to tackle food waste in a way that is close to daily life rather than abstract theory." },
      { "type": "text", "value": "During the tour, the four founders' passion was evident. They even referred to the Black Soldier Flies as their \"babies,\" which I was a little resistant to. However, their sincerity made their commitment feel genuine. I appreciated how openly they shared their progress and challenges without avoiding the difficulties of running a startup." },
      { "type": "text", "value": "What touched me most was the quiet support among startups in Vidacity. Although many may not survive beyond a year, founders still gather for coffee and conversations. It feels like an unspoken emotional support system." },
      { "type": "text", "value": "We often learn that international expansion is necessary for a company to scale up. However, in reality, importing and exporting Black Soldier Flies is complicated due to strict policies and regulations. It made me realise how sustainability work is not just about having a good idea. It is also deeply shaped by regulatory systems and practical limitations." },
      { "type": "text", "value": "Seeing their journey made the entrepreneurial frameworks I learned in class feel real. They were no longer distant theories on slides." }
    ],
    "keyTakeaways": []
  },
  {
    "id": "rayen-reflection",
    "title": "Waste as a Design Challenge",
    "date": "2026-02-07",
    "tags": ["ray-en", "reflection"],
    "summary": "Visiting BugBoom and listening to their sharing made \"food waste\" feel a lot less like an abstract environmental problem and a lot more like a design challenge, one that can be solved with the right biology, systems thinking, and discipline in execution.",
    "heroImage": "assets/photos/BBsitevisit (37).jpg",
    "content": [
      { "type": "title", "value": "Reflection after visiting BugBoom" },
      { "type": "text", "value": "Visiting BugBoom's site and listening to their sharing made \"food waste\" feel a lot less like an abstract environmental problem and a lot more like a design challenge. One that can be solved with the right biology, systems thinking, and discipline in execution. BugBoom positions their work as transforming food waste into \"high-quality farm products\" using Black Soldier Fly (BSF) technology, which immediately reframed waste from \"something to throw away\" into a nutrient stream that can be redirected." },
      { "type": "image", "src": "assets/photos/BBsitevisit (68).jpg", "alt": "Vidacity campus, a former primary school turned green sustainability hub", "caption": "Vidacity campus, where BugBoom calls home." },
      { "type": "text", "value": "What stuck with me most was how practical their mindset was. They didn't present sustainability as a \"feel-good\" idea. They presented it as an operational pipeline, a process with inputs, controls, outputs, and real-world constraints like contamination, consistency of food waste supply, space, and community acceptance. They also highlighted that the need is urgent: Singapore generated 784,000 tonnes of food waste in 2024, and only 18% was recycled. So improving diversion and treatment methods is not optional if we care about long-term resilience." },
      { "type": "text", "value": "One interesting line from their sharing:" },
      { "type": "text", "value": "\"We're not just managing waste, we're keeping nutrients in the loop, where they belong.\"" },
      { "type": "text", "value": "Even as a paraphrase, it captures the \"circular economy\" framing behind what they do: divert food waste from disposal, process it through BSF-based systems, and return value to agriculture and learning communities." },
      { "type": "title", "value": "BugBoom's process: from waste to value" },
      { "type": "text", "value": "Food waste is a major waste stream in Singapore and has a relatively low recycling rate. According to the National Environment Agency, food waste made up about 12% of total waste generated in 2024. 784,000 tonnes were generated, and the recycling rate was 18%. This gap creates an opportunity for solutions that can reduce disposal load, recover nutrients, and create usable outputs like fertiliser and feed inputs, while remaining safe and scalable." },
      { "type": "image", "src": "assets/photos/BBsitevisit (69).jpg", "alt": "Non-conforming bread donated by Chewy Junior's used as feedstock", "caption": "Non-conforming bread from Chewy Junior's, repurposed as BSF feedstock." },
      { "type": "text", "value": "BugBoom's model uses BSF technology to convert food waste into high-quality farm products, and they also promote on-site BSF composting as a pathway for localised waste treatment. They offer food waste management services, BSF-related products, and educational workshops for the public and schools." },
      { "type": "title", "value": "The operational pipeline" },
      { "type": "text", "value": "Here's how their end-to-end workflow looks as a BSF-based waste valorisation pipeline:" },
      { "type": "number-list", "value": [
        "Source food waste from partner sites or managed collection points.",
        "Screen and prep the waste to reduce contamination and keep feedstock consistent. This is critical for stable conversion outcomes.",
        "Introduce food waste to BSF larvae under controlled conditions.",
        "Larvae break down the food waste, converting it into larval biomass (used as protein/fat input in animal feed) and frass (residual material used as fertiliser).",
        "Harvest and separate outputs (larvae vs residual).",
        "Process outputs into usable farm products.",
        "Offer on-site BSF composting for more local, decentralised treatment.",
        "Run education and workshops to build understanding and acceptance, especially since insect-based solutions can face \"yuck factor\" barriers."
      ] },
      { "type": "image", "src": "assets/photos/BBsitevisit (71).jpg", "alt": "Mixing nutritious feed for the BSF larvae in the lab", "caption": "Mixing nutritious feed for the BSF larvae." },
      { "type": "image", "src": "assets/photos/BBsitevisit (73).jpg", "alt": "Sieving frass to separate it from the larvae", "caption": "Sieving the frass (fertiliser) from the larvae. This is where the value gets extracted." },
      { "type": "title", "value": "Education and outreach" },
      { "type": "text", "value": "A strong differentiator for BugBoom is that they don't only run the technical system. They also build awareness and literacy through structured workshops for different learner levels, from students to the general public. They even promote household-level participation concepts like \"household BSF farming,\" which suggests they're exploring both institutional and grassroots adoption pathways." },
      { "type": "image", "src": "assets/photos/BBsitevisit (74).jpg", "alt": "Newspaper mushroom exhibit at Vidacity showcasing upcycled art", "caption": "Creative upcycling on display at Vidacity. Sustainability is everywhere here." },
      { "type": "title", "value": "Why this matters" },
      { "type": "text", "value": "BugBoom's model is aligned with a broader Singapore push to improve food waste segregation and treatment, and to raise recycling outcomes. This includes newer requirements for large generators to segregate, treat, and report food waste. In other words, their approach fits the direction of travel: treat food waste as a managed resource, not just something to dispose of." },
      { "type": "title", "value": "A special question for the founders" },
      { "type": "text", "value": "We got to ask each of the four founders a pretty spicy question: \"At what valuation would you sell BugBoom?\" Their answers were all over the place, and honestly, that's what made it so interesting." },
      { "type": "bullet-list", "value": [
        "Ivan said $5 million, but even then he still wouldn't sell. He wants to wait until Series A for a proper evaluation, and he'll keep pricing the business higher until he feels it's right.",
        "En Cheng said he would never sell, no matter the amount. He also mentioned the other founders wouldn't even think about it.",
        "Vasanth Sreeram shared that investors currently evaluate them at $5 million, but at $6 million he'd be willing to sell.",
        "Taha Basrai said $350k."
      ] },
      { "type": "text", "value": "What's fascinating here is how wildly different each founder's answer is, even though they're all building the same company together. You've got one founder who wouldn't sell at any price, another who'd take $350k, and two others somewhere in between. It really makes you wonder: how much of a startup's \"value\" is about the numbers, and how much is about personal attachment, identity, and what the venture means to each person? It also raises a real question about what happens when co-founders have such different thresholds. At what point does that misalignment become a problem? Or maybe it's actually healthy, because it means at least some of them will always fight to keep the company alive." },
      { "type": "title", "value": "What I'm taking away" },
      { "type": "text", "value": "What I appreciate about BugBoom is that they make sustainability feel specific and actionable: a clear input (food waste), a biological engine (BSF larvae), and outputs that reconnect to productive use. All paired with education so that more people can understand and trust the process." },
      { "type": "image", "src": "assets/photos/BBsitevisit (43).jpg", "alt": "Vidacity's Grand Opening Signage", "caption": "Vidacity's Grand Opening Signage, a reminder that this space was built with purpose." },
      { "type": "text", "value": "It's not just about having the right values. It's about building systems that still work when conditions aren't perfect. And that's what makes BugBoom's story so compelling to me." }
    ],
    "keyTakeaways": [
      "Food waste is not just waste, it's a nutrient stream that can be redirected with the right systems",
      "Sustainability in practice looks more like an operational pipeline than a feel-good idea",
      "Education and community trust are just as important as the technical process itself",
      "Co-founders can have wildly different views on what their company is worth, and that tension says a lot about their motivations"
    ]
  },
  {
    "id": "shengzhe-reflection",
    "title": "From Concept to Execution",
    "date": "2026-02-07",
    "tags": ["sheng-zhe", "reflection"],
    "summary": "Had a really meaningful experience visiting Vidacity and BugBoom. As a university student exploring the startup journey, it was inspiring to see how both teams turned real-world problems into practical solutions with clear business direction.",
    "heroImage": "assets/photos/BBsitevisit (25).jpg",
    "content": [
      { "type": "text", "value": "Had a really meaningful experience visiting Vidacity and BugBoom. As a university student exploring the startup journey, it was inspiring to see how both teams turned real-world problems into practical solutions with clear business direction." },
      { "type": "image", "src": "assets/photos/BBsitevisit (25).jpg", "alt": "Upcycled art and crafts on display at Vidacity", "caption": "Creative upcycling on display at Vidacity." },
      { "type": "text", "value": "At Vidacity, I appreciated how the concept goes beyond just innovation. It showed how technology, sustainability and user needs can come together in a scalable ecosystem. It made me reflect on how important long-term vision and system-level thinking are when building a startup." },
      { "type": "image", "src": "assets/photos/BBsitevisit (56).jpg", "alt": "BSF larvae being sieved and sorted at BugBoom's facility", "caption": "A closer look at the BSF larvae at BugBoom's facility." },
      { "type": "text", "value": "At BugBoom, it was eye-opening to learn how they approach sustainability through a unique and impactful business model. Seeing how they combine science, operations and market demand gave me a better understanding of what it takes to run a startup beyond just having a good idea." },
      { "type": "text", "value": "Overall, the visit was both motivating and educational! It gave me a clearer perspective on how startups grow from concept to execution, and what it means to build something with real impact." }
    ],
    "keyTakeaways": []
  }
]
