[
  {
    "id": "finding-01",
    "title": "Slow Observation Beats Fast Data",
    "category": "Methods",
    "icon": "🔬",
    "pinned": true,
    "content": "The most valuable field observations came not from systematic sampling, but from unstructured time spent sitting quietly in one location. Thirty minutes of patient watching revealed behaviors, interactions, and species that rapid surveys consistently missed. Slow science is underrated."
  },
  {
    "id": "finding-02",
    "title": "Mycorrhizal Networks Are Everywhere",
    "category": "Results",
    "icon": "🍄",
    "pinned": true,
    "content": "Every soil sample showed evidence of mycorrhizal fungi connecting root systems across species. The 'wood wide web' isn't a metaphor—it's a measurable reality. Trees in our study plots shared carbon through fungal networks, with nurse trees supporting younger saplings through underground transfers."
  },
  {
    "id": "finding-03",
    "title": "Field Sketching Improves Retention",
    "category": "Lessons",
    "icon": "✏️",
    "pinned": true,
    "content": "Entries paired with hand-drawn sketches (even rough ones) showed significantly higher recall and richer observations than photo-only entries. The act of drawing forces you to look more carefully, notice proportions, and engage with your subject in a way that photography shortcuts. Add sketching to your field practice."
  },
  {
    "id": "finding-04",
    "title": "GPS Dependency Was a Mistake",
    "category": "Mistakes",
    "icon": "🧭",
    "pinned": false,
    "content": "Over-relying on GPS navigation led to a dangerous situation when batteries died on a remote trail. Traditional map-and-compass skills are not redundant—they're essential backup. After this incident, I now carry paper maps and practice dead reckoning on every trip. Technology should augment wildcraft, not replace it."
  },
  {
    "id": "finding-05",
    "title": "Weather Prediction Is a Learnable Skill",
    "category": "Results",
    "icon": "🌤️",
    "pinned": false,
    "content": "After a week of deliberate cloud watching and barometer reading, weather prediction accuracy reached approximately 75% for 12-hour forecasts using natural signs alone. Key indicators: cloud type progression (cirrus → cirrostratus → altostratus = rain incoming), wind direction shifts, animal behavior changes, and barometric pressure trends."
  },
  {
    "id": "finding-06",
    "title": "Build Local Species Checklists",
    "category": "Next Steps",
    "icon": "📋",
    "pinned": false,
    "content": "Creating region-specific checklists for trees, birds, fungi, and wildflowers dramatically accelerated field identification. Next step: develop a personal identification key for the 50 most common species in our study area, complete with seasonal markers, habitat preferences, and distinguishing features. Consider sharing these as open-access field guides."
  }
]
